import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:webview_flutter/webview_flutter.dart';

class InfoScreen extends StatefulWidget {
  const InfoScreen({Key? key}) : super(key: key);

  @override
  State<InfoScreen> createState() => _InfoScreenState();
}

class _InfoScreenState extends State<InfoScreen> {
  late WebViewController webViewController ;
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      // appBar: AppBar(
      //   backgroundColor: Colors.grey.shade400,
      //   iconTheme: const IconThemeData(
      //     color: Colors.black
      //   ),
      //   centerTitle: true,
      //   title: Text(
      //     "من نحن ",
      //     style: TextStyle(fontSize: 25.sp, color: Colors.black),
      //   ),
      // ),
      body: Container(
        alignment: Alignment.center,
        padding: EdgeInsets.symmetric(
          horizontal: 20.sp,
          vertical: 20.sp,
        ),
        child: ListView(
          children: [
            Container(
              decoration: BoxDecoration(

                  color: Colors.grey.shade200,
                  borderRadius: BorderRadius.circular(12.sp) ,
              ),
              alignment: Alignment.center,
              child: Text(
                "بازار فلسطين",
                style: TextStyle(fontSize: 30.sp),
              ),
            ),


            SizedBox(height: 15.h,),
            Text(
              """بوابتك الجديدة للتسوق الكترونياً بشكل مُبسط حيث جاءت فكرة المتجر لجعل عملية الشراء إلكترونيا عمليه سهلة وبسيطة وتوفر عليك الوقت والجهد والمال ,
حيث ستجد في متجرنا التنوع في المنتجات والسهولة في اختيارها والبحث عنها ،
يبذل طاقم متجر بازار فلسطين كافة الجهد الممكن تقديمه في جعل عملية التسوق لدينا ممتعه وسهلة وسريعة وتوفر كل ما تحتاجه  من تسهيلات سواء في اختيار المنتج او في عمليه الدفع أو في عملية التوصيل.

ماهو بازار فلسطين !؟
نحن متجر الكتروني نعرض منتجاتنا على موقع ويب الكتروني وأيضا من خلال تطبيق بازار فلسطين موبايل لتستطيع من خلاله مشاهدة المنتجات ومعاينتها ولتتعرف على أوصافها وصورها وتستطيع أن تقارن أسعارها
وبكل سهولة تقوم بطلبها من خلال نفس الموقع لتصلك طلبيتك خلال دقائق إلى عنوانك.
هدفنا أن نُسهل عليك تعب التسوق وأن نقدم لك الخيارات الكثيرة التي لا تجدها في أي مكان اخر لأننا جمعنا كل البضاعة من الموردين ووضعنا بين يديك في بازار فلسطين.
نسعى في بازار فلسطين لتسخير التقدم التكنلوجي لخدمتك وتوفير جهدك ووقتك ومالك.

المنتجات الي نقدمها عبر متجرنا الإلكتروني كثيرة ومتنوعة وعلى سبيل المثال لا الحصر:
- المواد الغذائية والاستهلاكية
- الطعام المُبرد والمُجمّد
- اللحوم الطازجة
- المشروبات الباردة والساخنة
- الخضراوات والفواكه الطازجة
- المحمص والبهارات والبقوليات
- مواد العناية الشخصية
- مواد العناية بالمنزل والمنظفات
- ألعاب الأطفال
- القرطاسية
- النثريات والأدوات المنزلية
 وغيرها الكثير الكثير..
تستطيع أن تقدم طلبيتك بأي وقت 24/7 وسنقوم بتوصيلها مباشرة بعد دقائق بمدة لا تزيد عن ساعة واحدة خلال اوقات التوصيل الموضحة على موقعنا

استلم مع الطبية فاتورة بمنتجاتك راجعها وشيك عليها قبل ما تدفع
في حال حدوث أي خطأ أو تلف في أحد منتجات طلبيتك فمن حقك اعادة أو استبدال المنتج دون أي تكالف اضافية عليك

نعمل الان على توصيل الطلبيات في بلدة عصيرة الشمالية - نابلس وسنقوم بتوسيع مناطق التوصيل لمحيط قرى نابلس ومن ثم إلى جميع مناطق الضفة الغربية خلال الفترة القريبة القادمة ان شاء الله

التواصل:
يمكنكم التواصل معنا عبر الايميل الالكتروني للمتجر care@palbazaar.com
أو عبر رسائل صفحتنا على الفيس بوك facebook.com/PalBazzar
أو من خلال التواصل مباشرة عبر رقم الواتساب 00970568506047

معلومات الشحن والتوصيل
=============
رسوم التوصيل:
نقوم بتحصيل رسوم بدل توصيل بتكلفة رمزية جدا, وهذه الرسوم متغيرة حسب القيمة الكلية للطلبية وعنوان العميل, ويمكن أن تصل هذه الرسوم الى الصفر (توصيل مجاني) تابع باستمرار عروضنا على المتجر وعلى صفحتنا على الفيس بوك.

طريقة الدفع:
الدفع يكون عند الاستلام

المدة الزمنية للتوصيل:
نسعى بكل جهد لإيصال الطلبية بأقرب وقت ممكن بحيث لا تتجاوز الفترة بين الموافقة على الطلبية وحتى توصيلها الى عنوانك ال 60 دقيقة !

ارجاع الطلبية وتكلفة التوصيل:

يمكنك عميلنا من تقديم طلب ارجاع الطلبية بعد وصولها اليك وذلك من خلال متجرنا حسب الشروط التالية
1- ان تكون فترة الارجاع لا تتجاوز ال12 ساعة من بعد استلام الطلبية
2- المواد الغذائية غير المعلبة مثل اللحوم والخضار الطازجة لا يمكن ارجاعها حفاظا على الصحة العامة
3- في حال كان سبب الارجاع خطأ أو تلف في المنتج فيمكن ارجاعه باي حال من الأحوال خلال فترة ال12 ساعة ولا يكون هناك تحصيل لرسوم الارجاع
4- في حال كان سبب الارجاع يعود الى العميل يتم تحصيل رسوم ارجاع بقيمة 10 شيكل """,
              style: TextStyle(fontSize: 20.sp),
            ),
          ],
        ),
      ),
    );
  }
}
